Documents/ЗаявкаНаДоставку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЗаявкаНаДоставку</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.РеализацияТоваровИУслуг</xr:Item>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>авто_Водитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>авто_ГосНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>авто_Марка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>авто_Модель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>авто_ТелефонВодителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВодительЗаберетГрузСамостоятельно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Comment>Используется при программной проверке заполненности ОбработкаПроверкиЗаполнения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоставленоДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоставленоОтветственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУлицы</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОтправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОжидаемаяДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОжидаемаяДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплачиваетПолучатель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаДоставку</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправленEMail</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправленоДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправленоОтветственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыДоставкиТовара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьДоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявокНаДоставку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ОтправленоСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ТекущийСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УДАЛИТЬ_СтатусыДоставкиТовара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Экспедитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗатратНаДоставку</Name>
					<Comment>Себестоимость доставки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонКонтактногоЛица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срочно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТранспортногоСредства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/NVA_ИсторияЗаявкиНаДоставку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>NVA_ИсторияЗаявкиНаДоставку</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаДоставку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаДоставку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЗаявкаНаДоставку/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования) 
	
	ОтправленEMail = Ложь;	
	//УДАЛИТЬ_ОтправленоСМС = Ложь;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
	Результат = Справочники.СтатусыЗаявокНаДоставку.Заявка; // №10663 заменено на справочник, было: Перечисления.СтатусыДоставкиТовара.Заявка;
	ОжидаемаяДатаОтправки = ТекущаяДатаСеанса();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Массив") И ДанныеЗаполнения.Количество() > 0 Тогда
		
		Если ТипЗнч(ДанныеЗаполнения[0]) = Тип("ДокументСсылка.ЗаказПокупателя") Или ТипЗнч(ДанныеЗаполнения[0]) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
			ЗаполнитьПоЗаказуПокупателяИлиРеализацииТоваровИУслуг(ДанныеЗаполнения);
		ИначеЕсли ТипЗнч(ДанныеЗаполнения[0]) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			ЗаполнитьПоЗаказуПоставщику(ДанныеЗаполнения);
		КонецЕсли;

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Или ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
		
		ЗаполнитьПоЗаказуПокупателяИлиРеализацииТоваровИУслуг(ДанныеЗаполнения); // №10663 унифицировано для массового создания
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		ЗаполнитьПоЗаказуПоставщику(ДанныеЗаполнения);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//++ №11954
	Если НЕ Метаданные.Документы.ЗаявкаНаДоставку.Реквизиты.Найти("ТекущийСтатус") = Неопределено
		И НЕ ПроверяемыеРеквизиты.Найти("ТекущийСтатус") = Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ТекущийСтатус"))
	КонецЕсли;
	//-- №11954
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Документы.ЗаказПокупателя.ПроверитьЗаполнениеНаОснованииЗаказа(ЭтотОбъект, Отказ, РежимЗаписи); 	
	
	//nva+++
	Если НЕ ЗначениеЗаполнено(ТелефонКонтактногоЛица) Тогда
		Отказ = Истина; 
		ТекстОшибки = НСтр("ru='Заполнение телефона контактного лица обязательно'");	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "ТелефонКонтактногоЛица", "Объект", Отказ);
	КонецЕсли;
	//Если СпособДоставки = Справочники.СпособыДоставкиТовара.СобственныйТранспорт Тогда
	//	Если НЕ ЗначениеЗаполнено(ТранспортноеСредство) Тогда
	//		Отказ = Истина; 
	//		ТекстОшибки = НСтр("ru='Если доставка осуществляется собственным транспортом, то заполнение транспортного средства обязательно'");	
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "ТранспортноеСредство", "Объект", Отказ);
	//	КонецЕсли;
	//КонецЕсли;
	//
	//Если Результат = Справочники.СтатусыЗаявокНаДоставку.Отправлено ИЛИ Результат = Справочники.СтатусыЗаявокНаДоставку.Доставлено Тогда
	//	Если СтоимостьДоставки + СтоимостьДоставки*0.2 <= СуммаЗатратНаДоставку Тогда
	//		Отказ = Истина; 
	//		ТекстОшибки = НСтр("ru='Если стомость доставки отличается от суммы оплаты компанией, то заполнение комментария обязательно'");	
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "Комментарий", "Объект", Отказ);
	//	КонецЕсли;
	//КонецЕсли;	
	//nva---
КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьПоЗаказуПокупателяИлиРеализацииТоваровИУслуг(ДанныеЗаполнения)
	
	МассивДокументов = Новый Массив;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Или ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
		МассивДокументов.Добавить(ДанныеЗаполнения);		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		МассивДокументов = ДанныеЗаполнения;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(МассивДокументов[0]) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Документы.ЗаказПокупателя.ПроверитьВозможностьВводаНаОснованииЗаказа(МассивДокументов, Истина); //nva
	КонецЕсли;
	
	Организация = МассивДокументов[0].Организация;
	Получатель 	= МассивДокументов[0].Контрагент;
	
	Если ЗначениеЗаполнено(МассивДокументов[0].АдресДоставки) Тогда
		АдресДоставки = МассивДокументов[0].АдресДоставки;
	Иначе
		АдресДоставки = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Получатель, Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента);
	КонецЕсли;
	
	// #16795
	Город = МассивДокументов[0].ГородДоставки;
	СпособДоставки = МассивДокументов[0].СпособДоставки;
	
	Для Каждого ЭлементМассива из МассивДокументов Цикл
		
		Если Получатель <> ЭлементМассива.Контрагент Тогда
			Текст = НСтр("ru = 'Контрагенты в выделенных документах различаются, создание документа невозможно'");
			ВызватьИсключение Текст;
		КонецЕсли;
		
		Если Организация <> ЭлементМассива.Организация Тогда
			Текст = НСтр("ru = 'Организации в выделенных документах различаются, создание документа невозможно'");
			ВызватьИсключение Текст;
		КонецЕсли;
		
		ДобавитьОснование(ЭлементМассива);
		
		Для Каждого ТекущаяСтрокаТоварыОснования Из ЭлементМассива.Товары Цикл
			
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекущаяСтрокаТоварыОснования.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
				
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрокаТоварыОснования);
			НоваяСтрока.Основание = ЭлементМассива;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаказуПоставщику(ДанныеЗаполнения)
	
	МассивДокументов = Новый Массив;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		МассивДокументов.Добавить(ДанныеЗаполнения);		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		МассивДокументов = ДанныеЗаполнения;
	Иначе
		Возврат;
	КонецЕсли;
	
	Организация = МассивДокументов[0].Организация;
	Получатель 	= МассивДокументов[0].Контрагент;
	
	АдресДоставки = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Получатель, Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента);
	
	// #16795
	//Город = МассивДокументов[0].ГородДоставки;
	СпособДоставки = МассивДокументов[0].СпособДоставкиТовара;
	
	Для Каждого ЭлементМассива из МассивДокументов Цикл
		
		Если Получатель <> ЭлементМассива.Контрагент Тогда
			Текст = НСтр("ru = 'Контрагенты в выделенных документах различаются, создание документа невозможно'");
			ВызватьИсключение Текст;
		КонецЕсли;
		
		Если Организация <> ЭлементМассива.Организация Тогда
			Текст = НСтр("ru = 'Организации в выделенных документах различаются, создание документа невозможно'");
			ВызватьИсключение Текст;
		КонецЕсли;
		
		ДобавитьОснование(ЭлементМассива);
		
		Для Каждого ТекущаяСтрокаТоварыОснования Из ЭлементМассива.Товары Цикл
			
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекущаяСтрокаТоварыОснования.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
				
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрокаТоварыОснования);
			НоваяСтрока.Основание = ЭлементМассива;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьОснование(ДанныеЗаполнения) Экспорт
	
	НайденныеСтроки = Основания.НайтиСтроки(Новый Структура("Основание", ДанныеЗаполнения));
	Если  НайденныеСтроки.Количество() = 0 Тогда
		НоваяСтрока = Основания.Добавить();
		НоваяСтрока.Основание = ДанныеЗаполнения;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТоварыПоОснованиям() Экспорт
	
	Товары.Очистить();
	
	Для Каждого СтрокаОснования Из Основания Цикл
		
		Если СтрокаОснования.Основание = Неопределено Или НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаОснования.Основание, "Товары") Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ТекущаяСтрока Из СтрокаОснования.Основание.Товары Цикл
			
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекущаяСтрока.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
				
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			НоваяСтрока.Основание = СтрокаОснования.Основание;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли

//nva+++
Процедура ПриЗаписи(Отказ)
	Если ДополнительныеСвойства.Свойство("ПредыдущаяОжидаемаяДатаОтправки")
		И НЕ ОжидаемаяДатаОтправки = ДополнительныеСвойства.ПредыдущаяОжидаемаяДатаОтправки Тогда
		// при программном создании / записи заказа свойство заполняется в "ИнициализироватьСлужебныеРеквизиты"
		// при создании через форму в "ПередЗаписьюНаСервере"
		ТекстКомментария = СтрШаблон("Изменена дата доставки с ""%1"" на ""%2""", ДополнительныеСвойства.ПредыдущаяОжидаемаяДатаОтправки, ОжидаемаяДатаОтправки);
		РегистрыСведений.NVA_ИсторияЗаявкиНаДоставку.ДобавитьЗаписьВИсторию(Ссылка, ТекущаяДатаСеанса(), Пользователи.ТекущийПользователь(), ТекстКомментария);
	КонецЕсли;
КонецПроцедуры
//nva---
